mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/lib/sdk11/components/libraries/bootloader_dfu/dfu_single_bank.c
/* Copyright (c) 2013 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#include <stddef.h>
#include "dfu.h"
#include <dfu_types.h>
#include "dfu_bank_internal.h"
#include "nrf.h"
#include "nrf_sdm.h"
#include "app_error.h"
#include "app_timer.h"
#include "bootloader.h"
#include "bootloader_types.h"
#include "pstorage.h"
#include "nrf_mbr.h"
#include "dfu_init.h"
#include "sdk_common.h"

#include "boards.h"

static dfu_state_t                  m_dfu_state;                /**< Current DFU state. */
static uint32_t                     m_image_size;               /**< Size of the image that will be transmitted. */

static dfu_start_packet_t           m_start_packet;             /**< Start packet received for this update procedure. Contains update mode and image sizes information to be used for image transfer. */
static uint8_t                      m_init_packet[128];         /**< Init packet, can hold CRC, Hash, Signed Hash and similar, for image validation, integrety check and authorization checking. */
static uint8_t                      m_init_packet_length;       /**< Length of init packet received. */
static uint16_t                     m_image_crc;                /**< Calculated CRC of the image received. */

APP_TIMER_DEF(m_dfu_timer_id);                                  /**< Application timer id. */
static bool                         m_dfu_timed_out = false;    /**< Boolean flag value for tracking DFU timer timeout state. */

static pstorage_handle_t            m_storage_handle_app;       /**< Pstorage handle for the application area (bank 0). Bank used when updating a SoftDevice w/wo bootloader. Handle also used when swapping received application from bank 1 to bank 0. */
static pstorage_handle_t          * mp_storage_handle_active;   /**< Pointer to the pstorage handle for the active bank for receiving of data packets. */

static dfu_callback_t               m_data_pkt_cb;              /**< Callback from DFU Bank module for notification of asynchronous operation such as flash prepare. */
static dfu_bank_func_t              m_functions;                /**< Structure holding operations for the selected update process. */


/**@brief Function for handling callbacks from pstorage module.
 *
 * @details Handles pstorage results for clear and storage operation. For detailed description of
 *          the parameters provided with the callback, please refer to \ref pstorage_ntf_cb_t.
 */
static void pstorage_callback_handler(pstorage_handle_t * p_handle,
                                      uint8_t             op_code,
                                      uint32_t            result,
                                      uint8_t           * p_data,
                                      uint32_t            data_len)
{
    switch (op_code)
    {
        case PSTORAGE_STORE_OP_CODE:
            if ((m_dfu_state == DFU_STATE_RX_DATA_PKT) && (m_data_pkt_cb != NULL))
            {
                m_data_pkt_cb(DATA_PACKET, result, p_data);
            }
            break;

        case PSTORAGE_CLEAR_OP_CODE:
            if (m_dfu_state == DFU_STATE_PREPARING)
            {
                // Special case for lazy erase - mark first page as erased
                if (dfu_page_erased != NULL && dfu_image_page_count > 0)
                {
                    dfu_page_erased[0] = 1;
                }

                m_functions.cleared();
#ifdef SIGNED_FW
                // Signed BLE reaches PREPARING only after INIT authentication;
                // signed serial and all unsigned transports prepare at START.
                if ( is_ota() )
                {
                    m_dfu_state = DFU_STATE_RX_DATA_PKT;
                    if (m_data_pkt_cb != NULL)
                    {
                        m_data_pkt_cb(INIT_PACKET, result, p_data);
                    }
                }
                else
#endif
                {
                    m_dfu_state = DFU_STATE_RDY;
                    if (m_data_pkt_cb != NULL)
                    {
                        m_data_pkt_cb(START_PACKET, result, p_data);
                    }
                }
            }
            break;

        default:
            break;
    }
    APP_ERROR_CHECK(result);
}

/**@brief Function for handling the DFU timeout.
 *
 * @param[in] p_context The timeout context.
 */
static void dfu_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    dfu_update_status_t update_status;

    m_dfu_timed_out           = true;
    update_status.status_code = DFU_TIMEOUT;

    bootloader_dfu_update_process(update_status);
}


/**@brief   Function for restarting the DFU Timer.
 *
 * @details This function will stop and restart the DFU timer. This function will be called by the
 *          functions handling any DFU packet received from the peer that is transferring a firmware
 *          image.
 */
static uint32_t dfu_timer_restart(void)
{
    if (m_dfu_timed_out)
    {
        // The DFU timer had already timed out.
        return NRF_ERROR_INVALID_STATE;
    }

    uint32_t err_code = app_timer_stop(m_dfu_timer_id);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_dfu_timer_id, DFU_TIMEOUT_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    return err_code;
}


/**@brief   Function for preparing flash before receiving an image.
 *
 * @details For lazy erase mode (OTA), this sets up the tracking array and erases
 *          only the first page to signal readiness. Subsequent pages are erased
 *          on-demand when stores target them.
 *          For non-OTA serial DFU, the complete page-rounded image region is
 *          erased before the transport is told that preparation completed.
 *          No erase is allowed to interrupt the ordered DATA stream.
 */
static void dfu_prepare_func_app_erase(uint32_t image_size)
{
    mp_storage_handle_active = &m_storage_handle_app;

    m_dfu_state = DFU_STATE_PREPARING;
    dfu_base_address = m_storage_handle_app.block_id;

    if ( is_ota() )
    {
        // Setup for lazy erase
        dfu_image_page_count = NRFX_CEIL_DIV(m_image_size, CODE_PAGE_SIZE);

        if (dfu_image_page_count < 1) dfu_image_page_count = 1; // This should not happen

        static uint8_t dfu_page_erased_static[256];
        dfu_page_erased = dfu_page_erased_static;
        memset(dfu_page_erased, 0, dfu_image_page_count);

        uint32_t err_code = pstorage_clear(&m_storage_handle_app, CODE_PAGE_SIZE);
        APP_ERROR_CHECK(err_code);
    }
    else
    {
        flash_nrf5x_erase(DFU_BANK_0_REGION_START, m_image_size);

