mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/lib/sdk11/components/libraries/bootloader_dfu/dfu_single_bank.c
    if (IS_UPDATING_SD(m_start_packet))
    {
        m_functions.activate = dfu_activate_sd;
    }
    else if (IS_UPDATING_BL(m_start_packet))
    {
        m_functions.activate = dfu_activate_bl;
    }
    else
    {
        m_functions.activate = dfu_activate_app;
    }

    // Valid peer activity detected. Hence restart the DFU timer.
    err_code = dfu_timer_restart();
    VERIFY_SUCCESS(err_code);

#ifdef SIGNED_FW
    if ( is_ota() )
    {
        // The START tuple is not authenticated by the Legacy DFU protocol.
        // BLE can defer preparation until the signed INIT packet is verified.
        m_dfu_state = DFU_STATE_RDY;
        if (m_data_pkt_cb != NULL)
        {
            m_data_pkt_cb(START_PACKET, NRF_SUCCESS, NULL);
        }
    }
    else
#endif
    {
        // Unsigned DFU has no later authentication gate. Serial hosts also
        // require this ordering because they wait for erase after START.
        m_functions.prepare(m_image_size);
    }

    return NRF_SUCCESS;
}


uint32_t dfu_data_pkt_handle(dfu_update_packet_t * p_packet)
{
    uint32_t   data_length;
    uint32_t   err_code;
    uint32_t * p_data;

    VERIFY_PARAM_NOT_NULL(p_packet);

    // Check pointer alignment.
    if (!is_word_aligned(p_packet->params.data_packet.p_data_packet))
    {
        // The p_data_packet is not word aligned address.
        return NRF_ERROR_INVALID_ADDR;
    }

    switch (m_dfu_state)
    {
        case DFU_STATE_RDY:
        case DFU_STATE_RX_INIT_PKT:
            return NRF_ERROR_INVALID_STATE;

        case DFU_STATE_RX_DATA_PKT:
            if ((m_data_received > m_image_size) ||
                (p_packet->params.data_packet.packet_length >
                 ((m_image_size - m_data_received) / sizeof(uint32_t))))
            {
                // The caller is trying to write more bytes into the flash than the size provided to
                // the dfu_image_size_set function. This is treated as a serious error condition and
                // an unrecoverable one. Hence point the variable mp_app_write_address to the top of
                // the flash area. This will ensure that all future application data packet writes
                // will be blocked because of the above check.
                m_data_received = 0xFFFFFFFF;

                return NRF_ERROR_DATA_SIZE;
            }

            data_length = p_packet->params.data_packet.packet_length * sizeof(uint32_t);

            // Valid peer activity detected. Hence restart the DFU timer.
            err_code = dfu_timer_restart();
            VERIFY_SUCCESS(err_code);

            p_data = (uint32_t *)p_packet->params.data_packet.p_data_packet;

            if ( is_ota() )
            {
                while(1) {
                    err_code = pstorage_store(mp_storage_handle_active, (uint8_t *)p_data, data_length, m_data_received);
                    if (err_code != NRF_ERROR_NO_MEM)
                        break;
                    // No space, wait until an entry in the queue is freed
                    while (NRF_ERROR_NOT_FOUND != proc_soc()) {
                        // nothing
                    }
                }
                VERIFY_SUCCESS(err_code);
            }
            else
            {
                flash_nrf5x_write(DFU_BANK_0_REGION_START + m_data_received, p_data, data_length, false);
                pstorage_callback_handler(mp_storage_handle_active, PSTORAGE_STORE_OP_CODE, NRF_SUCCESS, (uint8_t *) p_data, data_length);
            }

            m_data_received += data_length;

            if (m_data_received != m_image_size)
            {
                // The entire image is not received yet. More data is expected.
                err_code = NRF_ERROR_INVALID_LENGTH;
            }
            else
            {
                if ( !is_ota() ) flash_nrf5x_flush(false);

                // The entire image has been received. Return NRF_SUCCESS.
                err_code = NRF_SUCCESS;
            }
            break;

        default:
            err_code = NRF_ERROR_INVALID_STATE;
            break;
    }

    return err_code;
}


uint32_t dfu_init_pkt_complete(void)
{
    uint32_t err_code = NRF_ERROR_INVALID_STATE;

    // DFU initialization has been done and a start packet has been received.
    if (IMAGE_WRITE_IN_PROGRESS())
    {
        // Image write is already in progress. Cannot handle an init packet now.
        return NRF_ERROR_INVALID_STATE;
    }

    if (m_dfu_state == DFU_STATE_RX_INIT_PKT)
    {
        err_code = dfu_init_prevalidate(m_init_packet,
                                        m_init_packet_length,
                                        m_start_packet.dfu_update_mode,
                                        m_image_size);
        if (err_code == NRF_SUCCESS)
        {
#ifdef SIGNED_FW
            if ( is_ota() )
            {
                m_functions.prepare(m_image_size);
            }
            else
#endif
            {
                m_dfu_state = DFU_STATE_RX_DATA_PKT;
            }
        }
        else
        {
            m_init_packet_length = 0;
        }
    }
    return err_code;
}


uint32_t dfu_init_pkt_handle(dfu_update_packet_t * p_packet)
{
    uint32_t err_code = NRF_SUCCESS;
    uint32_t length;

    switch (m_dfu_state)
    {
        case DFU_STATE_RDY:
            m_dfu_state = DFU_STATE_RX_INIT_PKT;
            // When receiving init packet in state ready just update and fall through this case.
            /* FALLTHRU */

        case DFU_STATE_RX_INIT_PKT:
            // DFU initialization has been done and a start packet has been received.
            if (IMAGE_WRITE_IN_PROGRESS())
            {
                // Image write is already in progress. Cannot handle an init packet now.
                return NRF_ERROR_INVALID_STATE;
            }

            // Valid peer activity detected. Hence restart the DFU timer.
            err_code = dfu_timer_restart();
            VERIFY_SUCCESS(err_code);

            if (p_packet->params.data_packet.packet_length >
                (sizeof(m_init_packet) / sizeof(uint32_t)))
            {
                return NRF_ERROR_INVALID_LENGTH;
            }

            length = p_packet->params.data_packet.packet_length * sizeof(uint32_t);
            if (m_init_packet_length > (sizeof(m_init_packet) - length))
            {
                return NRF_ERROR_INVALID_LENGTH;
            }

            memcpy(&m_init_packet[m_init_packet_length],
                   &p_packet->params.data_packet.p_data_packet[0],
                   length);
            m_init_packet_length += length;
            break;

        default:
            // Either the start packet was not received or dfu_init function was not called before.
            return NRF_ERROR_INVALID_STATE;
    }

    return NRF_SUCCESS;
}


uint32_t dfu_image_validate()
{
    uint32_t err_code;

